package com.competition.jitiao;

public class fenpei {

    // 某公司举办团建活动，在游戏环节，为了保证公平性，现在需要按照年龄将 n 个人分配为两个队伍，要求两个队伍的人的平均年龄相等，人数可以不相等。如果可以分配成功，则输出 “Yes”；否则，输出 “No”。
    //
    //输入描述
    //输入两行。第一行输入人数 n。第二行输入 n 个人的年龄整数。
    //
    //输出描述
    //若能够分配为两个队伍，则输出 “Yes”；否则，输出 “No”。
    //
    //示例一:
    //输入：
    //8
    //21 22 23 24 25 26 27 28
    //
    //输出：
    //Yes
    //
    //示例二：
    //输入：
    //2
    //23 21
    //
    //输出：
    //No
    //
    //备注:
    //1 <= n <= 100
    //1 <= 年龄 <= 100
    public static void main(String[] args) {

    }

}
